Autodesk.Revit.DB.DeleteWorksetOption
This class defines an enumerative type used to specify the option to delete a workset.
Since:
2022.1
This enumerative type corresponds to the possible options to delete a workset.
Since:
2022.1

Autodesk.Revit.DB.DeleteWorksetOption.DeleteAllElements
Delete a workset together with all the elements in this workset.

Autodesk.Revit.DB.DeleteWorksetOption.MoveElementsToWorkset
Delete a workset, while moving the elements from the deleted workset to another workset.